/*
  网站的工作原理

    1、客户端：进行用户交互，并将其转换为对另一台称为web服务器的计算机的请求，虽然通常是用浏览器访问网络，

    你可以进行"客户端"抽象意义上的叫法。
 
    2、服务器：安装特定的服务器软件，主要是为了响应客户端的请求，它的实质是存储资源。

    3、ip地址：互联网上每台机器都有一个IP地址，（逻辑地址）

     为了定位设备，厂家会将一个物理地址内嵌在你的计算机中。

    4、ISP

     客户端和服务器端的中间人，主要是为了获取被键入浏览器中的url中的ip地址。

    5、DNS

     主要是为了进行域名解析。

    6、TCP/IP

    网络应用的最广泛的协议。

    7、http

    超文本传输协议，主要作用于客户端和服务器之间通信进行服务。

    8、URl
     
    统一资源定位符。特定标识网络上的某种资源。

    9、描述一下这个过程

    提出请求，请求信息被分解成许多被称为数据块包的小块。每一个数据块都具有一些标识信息，经过tcp/ip的连接进行多次的
    跳转，直至目的地获的响应资源，通过浏览器中的渲染引擎进行资源的处理和解析，最终呈现给用户。

 */
